Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry Fields
The ConnectiveGeometry type exposes the following members.
Fields
Name | Description
InvalidGeometrySectionIndex
 An invalid geometry section index.
Top
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace